In [2]:
import pandas as pd
import numpy as np

df = pd.read_csv('String_processing.csv', sep = '|')
df

   Country   Users    Phone_numbers Plan Cost
0    India   RAHUL    91-9737964925        12
1    India   Rohit   91-9737964925      ($12)
2    India   Panda    91-9737964925     ($15)
3      USA  albert    91-9737964925     ($18)
4      USA  np.nan    91-9737964925     ($14)
5        n   dinNO    91-9737964925     ($13)
6      AUS  Markus    91-9737964925     ($11)
7      AUS  Renata    91-9737964925      ($9)
8     CANA     Tim    91-9737964925      ($8)
9     CANA     Tom    91-9737964925      ($7)
10    CANA  turner    91-9737964925      ($6)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Country        11 non-null     object
 1   Users          11 non-null     object
 2   Phone_numbers  11 non-null     object
 3   Plan Cost      11 non-null     object
dtypes: object(4)
memory usage: 484.0+ bytes